Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data
Task:
1. Create an sqlalchemy engine using a sample from the data set
2. Write two basic update queries
3. Write two delete queries
4. Write two filter queries
5. Write two function queries

In [13]:
import numpy as np
import pandas as pd
import sqlite3

In [14]:
import sqlalchemy

In [15]:
sqlalchemy.__version__

'1.3.3'

In [16]:
from sqlalchemy import create_engine

In [7]:
adult='https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
columns=('age','workclass','fnlwgt','education','education_num','marital_status','occupation','relationship','race','sex','capital_gain','captial_loss','hours_per_week','native_country','income')
adult=pd.read_csv(adult,names=columns)
adult.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,captial_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

Write two basic update queries

In [9]:
engine = create_engine('sqlite:///sqladb', echo=False)
adult.to_sql('sqladb', engine, if_exists ='replace')
connection = sqlite3.connect("sqladb")
cursor = connection.cursor()

UPDATE RECORD

In [10]:
cursor.execute('UPDATE sqladb SET fnlwgt = "1515" WHERE fnlwgt = "83311"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(2))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   39          State-gov   77516   Bachelors             13
1      1   50   Self-emp-not-inc    1515   Bachelors             13

        marital_status        occupation    relationship    race    sex  \
0        Never-married      Adm-clerical   Not-in-family   White   Male
1   Married-civ-spouse   Exec-managerial         Husband   White   Male

   capital_gain  captial_loss  hours_per_week  native_country  income
0          2174             0              40   United-States   <=50K
1             0             0              13   United-States   <=50K

In [11]:
print(pd.read_sql_query("SELECT * FROM sqladb where fnlwgt = 1515", connection).head(5))

   index  age          workclass  fnlwgt     education  education_num  \
0      1   50   Self-emp-not-inc    1515     Bachelors             13
1  16474   54   Self-emp-not-inc    1515   Prof-school             15

        marital_status        occupation relationship    race    sex  \
0   Married-civ-spouse   Exec-managerial      Husband   White   Male
1   Married-civ-spouse    Prof-specialty      Husband   White   Male

   capital_gain  captial_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              30   United-States    >50K

In [25]:
cursor.execute('UPDATE sqladb SET marital_status = " Married" WHERE marital_status = " Married-civ-spouse"')
print(pd.read_sql_query("select * from sqladb", connection).head(2))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   39          State-gov   77516   Bachelors             13
1      1   50   Self-emp-not-inc   83311   Bachelors             13

   marital_status        occupation    relationship    race    sex  \
0   Never-married      Adm-clerical   Not-in-family   White   Male
1         Married   Exec-managerial         Husband   White   Male

   capital_gain  captial_loss  hours_per_week  native_country  income
0          2174             0              40   United-States   <=50K
1             0             0              13   United-States   <=50K

Write two delete queries

In [31]:
cursor.execute('DELETE FROM sqladb where education_num = "7"')
print (pd.read_sql_query("SELECT * FROM sqladb where education_num = 7", connection).head(2))

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, captial_loss, hours_per_week, native_country, income]
Index: []

In [27]:
cursor.execute('DELETE FROM sqladb WHERE age = "53" AND fnlwgt = "234721"')
print(pd.read_sql_query("select * from sqladb", connection).head())

   index  age          workclass  fnlwgt   education  education_num  \
0      0   39          State-gov   77516   Bachelors             13
1      1   50   Self-emp-not-inc   83311   Bachelors             13
2      2   38            Private  215646     HS-grad              9
3      4   28            Private  338409   Bachelors             13
4      5   37            Private  284582     Masters             14

   marital_status          occupation    relationship    race      sex  \
0   Never-married        Adm-clerical   Not-in-family   White     Male
1         Married     Exec-managerial         Husband   White     Male
2        Divorced   Handlers-cleaners   Not-in-family   White     Male
3         Married      Prof-specialty            Wife   Black   Female
4         Married     Exec-managerial            Wife   White   Female

   capital_gain  captial_loss  hours_per_week  native_country  income
0          2174             0              40   United-States   <=50K
1             0             0              13   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

Write two filter queries

In [39]:
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE workclass = " Private" AND age < 20 AND race = " White" AND native_country=" Mexico"')
output= cursor.fetchall()
print(output)

[(142, 19, ' Private', 316868, ' Some-college', 10, ' Never-married', ' Other-service', ' Own-child', ' White', ' Male', 0, 0, 30, ' Mexico', ' <=50K'), (335, 17, ' Private', 270942, ' 5th-6th', 3, ' Never-married', ' Other-service', ' Other-relative', ' White', ' Male', 0, 0, 48, ' Mexico', ' <=50K'), (3118, 19, ' Private', 130431, ' 5th-6th', 3, ' Never-married', ' Farming-fishing', ' Not-in-family', ' White', ' Male', 0, 0, 36, ' Mexico', ' <=50K'), (9960, 19, ' Private', 228238, ' HS-grad', 9, ' Never-married', ' Machine-op-inspct', ' Other-relative', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K'), (13286, 18, ' Private', 333611, ' 5th-6th', 3, ' Never-married', ' Other-service', ' Other-relative', ' White', ' Male', 0, 0, 54, ' Mexico', ' <=50K'), (14157, 17, ' Private', 270942, ' HS-grad', 9, ' Never-married', ' Other-service', ' Other-relative', ' White', ' Male', 0, 0, 35, ' Mexico', ' <=50K'), (14520, 18, ' Private', 79443, ' 9th', 5, ' Never-married', ' Machine-op-inspct', ' Own-child', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K'), (21786, 18, ' Private', 335065, ' 7th-8th', 4, ' Never-married', ' Sales', ' Own-child', ' White', ' Male', 0, 0, 30, ' Mexico', ' <=50K'), (22107, 17, ' Private', 438996, ' 10th', 6, ' Never-married', ' Other-service', ' Other-relative', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K'), (23875, 19, ' Private', 316797, ' 7th-8th', 4, ' Married', ' Handlers-cleaners', ' Own-child', ' White', ' Male', 0, 0, 45, ' Mexico', ' <=50K'), (24352, 18, ' Private', 184693, ' Some-college', 10, ' Never-married', ' Other-service', ' Own-child', ' White', ' Female', 0, 0, 20, ' Mexico', ' <=50K'), (24951, 19, ' Private', 277695, ' 9th', 5, ' Never-married', ' Farming-fishing', ' Other-relative', ' White', ' Male', 0, 0, 16, ' Mexico', ' <=50K'), (27405, 18, ' Private', 426836, ' 5th-6th', 3, ' Never-married', ' Handlers-cleaners', ' Other-relative', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K'), (27531, 19, ' Private', 472807, ' 1st-4th', 2, ' Never-married', ' Handlers-cleaners', ' Other-relative', ' White', ' Male', 0, 0, 52, ' Mexico', ' <=50K'), (27794, 19, ' Private', 225775, ' Some-college', 10, ' Never-married', ' Craft-repair', ' Not-in-family', ' White', ' Male', 0, 0, 45, ' Mexico', ' <=50K'), (28836, 19, ' Private', 311974, ' HS-grad', 9, ' Never-married', ' Craft-repair', ' Other-relative', ' White', ' Male', 0, 0, 25, ' Mexico', ' <=50K'), (29457, 19, ' Private', 340567, ' 1st-4th', 2, ' Never-married', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 55, ' Mexico', ' <=50K'), (29876, 19, ' Private', 311974, ' 1st-4th', 2, ' Never-married', ' Machine-op-inspct', ' Other-relative', ' White', ' Male', 0, 0, 40, ' Mexico', ' <=50K')]

In [40]:
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Masters" AND age < 50 AND marital_status = " Divorced" AND native_country =" United-States" AND Sex =" Male" AND income =" <=50K"')
output = cursor.fetchall()
print(output)

[(378, 46, ' Self-emp-not-inc', 80914, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Not-in-family', ' White', ' Male', 0, 0, 30, ' United-States', ' <=50K'), (569, 47, ' Private', 87490, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Unmarried', ' White', ' Male', 0, 0, 42, ' United-States', ' <=50K'), (996, 45, ' Private', 89325, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 45, ' United-States', ' <=50K'), (1675, 43, ' Private', 37937, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Unmarried', ' White', ' Male', 0, 0, 50, ' United-States', ' <=50K'), (2186, 47, ' Self-emp-not-inc', 77102, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3160, 43, ' Local-gov', 247514, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Unmarried', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3979, 48, ' Private', 96798, ' Masters', 14, ' Divorced', ' Sales', ' Not-in-family', ' White', ' Male', 0, 0, 35, ' United-States', ' <=50K'), (5283, 40, ' Private', 167265, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 43, ' United-States', ' <=50K'), (5305, 42, ' Federal-gov', 74680, ' Masters', 14, ' Divorced', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 0, 2001, 60, ' United-States', ' <=50K'), (5648, 45, ' State-gov', 67544, ' Masters', 14, ' Divorced', ' Protective-serv', ' Not-in-family', ' White', ' Male', 0, 0, 50, ' United-States', ' <=50K'), (5926, 42, ' Private', 259643, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 4650, 0, 40, ' United-States', ' <=50K'), (8185, 37, ' Private', 312271, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Not-in-family', ' White', ' Male', 0, 0, 65, ' United-States', ' <=50K'), (8390, 45, ' Local-gov', 195418, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (8766, 42, ' Local-gov', 176716, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (11257, 37, ' Private', 372525, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Unmarried', ' White', ' Male', 0, 0, 48, ' United-States', ' <=50K'), (11818, 36, ' State-gov', 108320, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Unmarried', ' White', ' Male', 5455, 0, 30, ' United-States', ' <=50K'), (17228, 41, ' Local-gov', 33068, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 1974, 40, ' United-States', ' <=50K'), (22434, 45, ' Private', 168262, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (25379, 45, ' State-gov', 127089, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Not-in-family', ' White', ' Male', 0, 0, 45, ' United-States', ' <=50K'), (25520, 48, ' State-gov', 49595, ' Masters', 14, ' Divorced', ' Protective-serv', ' Not-in-family', ' White', ' Male', 0, 0, 72, ' United-States', ' <=50K'), (25878, 45, ' Self-emp-not-inc', 246891, ' Masters', 14, ' Divorced', ' Craft-repair', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (26219, 42, ' State-gov', 219682, ' Masters', 14, ' Divorced', ' Exec-managerial', ' Not-in-family', ' White', ' Male', 0, 0, 45, ' United-States', ' <=50K'), (29189, 40, ' Private', 56072, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (29537, 46, ' Local-gov', 133969, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' Amer-Indian-Eskimo', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (29695, 47, ' Private', 606752, ' Masters', 14, ' Divorced', ' Tech-support', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (30271, 41, ' State-gov', 100800, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 35, ' United-States', ' <=50K'), (30374, 42, ' State-gov', 121265, ' Masters', 14, ' Divorced', ' Prof-specialty', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K')]

Write two function queries

In [41]:
from sqlalchemy.sql import func
print(pd.read_sql_query("SELECT max(capital_gain),min(capital_gain),avg(capital_gain) FROM sqladb ", connection).head(2))

   max(capital_gain)  min(capital_gain)  avg(capital_gain)
0              99999                  0        1109.940228

In [43]:
def weekly_hours():
    cursor.execute('SELECT avg(hours_per_week) FROM sqladb where occupation = " Handlers-cleaners" AND sex =" Male" AND workclass = " Private"')
    output = cursor.fetchall()
    print(output)

In [44]:
weekly_hours()

[(38.70796460176991,)]

In [46]:
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education_num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
captial_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB